Tipos/ProofsAndTypes/sentido.org
#+title: Sentido
#+author: mou
#+date: <2025-09-12 Fri>
#+export_file_name: sentido
#+startup: overview

* Sentido y denotación en la lógica
Empecemos con un ejemplo. Hay un procedimiento estándar para la multiplicación, que, para las entradas
\(27\) y \(37\) da como resultado \(999\). ¿Qué podemos decir sobre esto?

Un primer intento es decir que tenemos una igualdad
\[ 27 \times 37 = 999 \]
Esta igualdad hace sentido en la matemática usual diciendo que los dos lados *denotan* al mismo número entero
y que la \(\times\) es una *función* en el sentido Cantoriano de una gráfica.

Este es el aspecto denotacional, que es, sin duda, correcto, pero deja de lado el aspecto esencial:

Hay un proceso *computacional* que muestra que las denotaciones son iguales. Es un abuso decir que
\(27 \times 37\) *es igual* a \(999\), pues si las sod cosas que tenemos fueran la *misma* cosa, nunca sentiríamos la
necesidad de establecer su igualdad. Concretamente, hacemos la *pregunta* \(27 \times 37\) y obtenemos una *respuesta*
\(999\). Las dos expresiones tienen *sentidos* diferentes y debemos *hacer* algo (dar una demostración o un
cálculo) para mostrar que estos dos *sentidos* tienen la misma *denotación*.

En cuanto a \(\times\), es incorrecto decir que esta es una función (como una gráfica) pues la computadora en la
que se carga el programa no tiene espacio para una gráfica infinita. Así que debemos concluir la presencia
de una dinámica *finitista* relacionada a esta cuestión del sentido.

Mientras que la denotación fue modelada en una etapa muy temprana, el sentido ha sido desplazado hacia la
*subjetividad*, con el resultado de que el tratamiento matemático actual del sentido está más o menos reducido
a la manipulación *sintáctica*. Esto no es *a priori* la esencia del sujeto, y podemos esperar que en las
siguientes décadas se encuentre un tratamiento de la computación que combine las ventajas de la
semántica denotacional (claridad matemática) con las de la sintaxis (dinámica finitista). Este
libro se asienta sobre la tradición que está basada en el estado actual de las cosas: en la dicotomía
entre la *denotación estática, infinita* y el *sentido dinámico, finito*, el lado denotacional está mucho más
desarrollado que el otro.

Así, una de las distinciones más fundamentales en la lógica es la hecha por Frege: dado un enunciado \(A\),
hay dos maneras de verlo:
- como una secuencia de *instrucciones*, que determinan su *sentido*, por ejemplo, \(A \lor B\) significa "\(A\) o
  \(B\)", etc..
- como el *resultado ideal* encontrado por estas operaciones: esto es su denotación.

  La "Denotación", en oposición a la "notación" es lo que es *denotado*, no lo que *denota*. Por ejemplo, la
  denotación de un enunciado lógico es *v* (verdadero) o *f* (falso), y la denotación de \(A \lor B\) se puede
  obtener de las denotaciones de \(A\) y de \(B\) mediante la tabla de verdad para la disyunción.

Dos enunciados que tienen el mismo sentido tienen la misma denotación, eso es obvio; pero dos enunciados con
la misma denotación raramente tienen el mismo sentido. Por ejemplo, tomemos una equivalencia matemática
complicada \(A \iff B\). Los dos enunciados tienen la misma denotación (son verdaderas al mismo tiempo) pero
seguramente no tienen el mismo sentido, si no, ¿cuál sería el sentido de mostrar la equivalencia?

Este ejemplo nos permite introducir algunas asociaciones de ideas:
- sentido, sintaxis, demostraciones;
- denotación, veracidad, semántica, operaciones algebráicas.

  Esta es la dicotomía fundamental de la lógica. Habiendo dicho esto, los dos lados dificilmente juegan
  papeles simétricos.

