public/Tipos/ProofsAndTypes/sentido.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-23 Tue 14:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sentido</title>
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='/style.css' />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
        <div class="navbar-brand">
            <a href="/index.html">🏠 Home</a>
        </div>
        <div class="navbar-menu">
                <div class="navbar-item dropdown">
                        <a href="#" class="dropbtn">🖥️ Computación</a>
                        <div class="dropdown-content">
                                <a href="/Computacion/index.html">📋 Resumen</a>
                                <div class="dropdown-submenu">
                                        <a href="#" class="submenu-btn">⚙️ Algoritmos</a>
                                        <div class="submenu-content">
                                                <a href="/Computacion/Algoritmos/index.html">📋 Resumen</a>
                                                <a href="/Computacion/Algoritmos/pensamiento.html">🧠 Pensamiento algorítmico</a>
                                        </div>
                                </div>
                        </div>
                </div>
                <div class="navbar-item dropdown">
                        <a href="#" class="dropbtn">🤖 AI</a>
                        <div class="dropdown-content">
                                <a href="/AI/index.html">📋 Resumen</a>
                                <div class="dropdown-submenu">
                                        <a href="#" class="submenu-btn">📚 CS229</a>
                                        <div class="submenu-content">
                                                <a href="/AI/CS229/index.html">📋 Resumen</a>
                                                <a href="/AI/CS229/AprendizajeSupervisado/aprendizaje_supervisado.html">🎯 Aprendizaje Supervisado</a>
                                                <a href="/AI/CS229/AprendizajeSupervisado/regresion_lineal.html">📈 Regresión Lineal</a>
                                        </div>
                                </div>
                                <div class="dropdown-submenu">
                                        <a href="#" class="submenu-btn">🏗️ DataCamp</a>
                                        <div class="submenu-content">
                                                <a href="/AI/DataCamp/index.html">📋 Resumen</a>
                                                <a href="/AI/DataCamp/desglosando_el_transformer.html">🔍 Desglosando el Transformer</a>
                                                <a href="/AI/DataCamp/embedding_y_codificacion_posicional.html">🔗 Embedding y Codificación Posicional</a>
                                        </div>
                                </div>
                        </div>
                </div>
                <div class="navbar-item dropdown">
                        <a href="#" class="dropbtn">🔤 Tipos</a>
                        <div class="dropdown-content">

                                <div class="dropdown-submenu">
                                        <a href="#" class="submenu-btn">✍️ Pruebas y tipos</a>
                                        <div class="submenu-content">
                                                <a href="/Tipos/ProofsAndTypes/index.html">📋 Resumen </a>
                                                <a href="/Tipos/ProofsAndTypes/sentido.html">🧠 Sentido, denotación y semántica</a>
                                        </div>
                                </div>

                                <div class="dropdown-submenu">
                                        <a href="#" class="submenu-btn">🔬 HoTT</a>
                                        <div class="submenu-content">
                                                <div class="dropdown-submenu">
                                                        <a href="#" class="submenu-btn">🏫 HoTT (Carnegie Mellon)</a>
                                                        <div class="submenu-content">
                                                                <a href="/Tipos/HoTT/Curso/index.html">📋 Resumen</a>
                                                                <a href="/Tipos/HoTT/Curso/introduccion.html">🚀 Introducción</a>
                                                                <a href="/Tipos/HoTT/Curso/juicios.html">⚖️ Juicios</a>
                                                                <a href="/Tipos/HoTT/Curso/transitividad.html">🔛 Transitividad </a>
                                                                <a href="/Tipos/HoTT/Curso/exponenciales.html">🗼 Exponenciales</a>
                                                                <a href="/Tipos/HoTT/Curso/igualdad.html">🟰 Igualdad</a>
                                                        </div>
                                                </div>

                                                <div class="dropdown-submenu">
                                                        <a href="#" class="submenu-btn">📚 Introducción a HoTT (Rijke)</a>
                                                        <div class="submenu-content">
                                                                <a href="/Tipos/HoTT/Rijke/index.html">📋 Resumen </a>
                                                                <a href="/Tipos/HoTT/Rijke/intro.html">📖 Introducción </a>
                                                        </div>
                                                </div>
                                        </div>
                                </div>

                                <div class="dropdown-submenu">
                                        <a href="#" class="submenu-btn">🖥️ Lean</a>
                                        <div class="submenu-content">
                                                <a href="/Tipos/Lean/index.html">📋 Resumen </a>
                                        </div>
                                </div>
                        </div>
                </div>
        </div>
  </nav>
</div>
<div id="content" class="content">
<h1 class="title">Sentido</h1>
<div id="outline-container-orgb66d479" class="outline-2">
<h2 id="orgb66d479">Sentido y denotación en la lógica</h2>
<div class="outline-text-2" id="text-orgb66d479">
<p>
Empecemos con un ejemplo. Hay un procedimiento estándar para la multiplicación, que, para las entradas
\(27\) y \(37\) da como resultado \(999\). ¿Qué podemos decir sobre esto?
</p>

<p>
Un primer intento es decir que tenemos una igualdad
\[ 27 \times 37 = 999 \]
Esta igualdad hace sentido en la matemática usual diciendo que los dos lados <b>denotan</b> al mismo número entero
y que la \(\times\) es una <b>función</b> en el sentido Cantoriano de una gráfica.
</p>

<p>
Este es el aspecto denotacional, que es, sin duda, correcto, pero deja de lado el aspecto esencial:
</p>

<p>
Hay un proceso <b>computacional</b> que muestra que las denotaciones son iguales. Es un abuso decir que
\(27 \times 37\) <b>es igual</b> a \(999\), pues si las sod cosas que tenemos fueran la <b>misma</b> cosa, nunca sentiríamos la
necesidad de establecer su igualdad. Concretamente, hacemos la <b>pregunta</b> \(27 \times 37\) y obtenemos una <b>respuesta</b>
\(999\). Las dos expresiones tienen <b>sentidos</b> diferentes y debemos <b>hacer</b> algo (dar una demostración o un
cálculo) para mostrar que estos dos <b>sentidos</b> tienen la misma <b>denotación</b>.
</p>

<p>
En cuanto a \(\times\), es incorrecto decir que esta es una función (como una gráfica) pues la computadora en la
que se carga el programa no tiene espacio para una gráfica infinita. Así que debemos concluir la presencia
de una dinámica <b>finitista</b> relacionada a esta cuestión del sentido.
</p>

<p>
Mientras que la denotación fue modelada en una etapa muy temprana, el sentido ha sido desplazado hacia la
<b>subjetividad</b>, con el resultado de que el tratamiento matemático actual del sentido está más o menos reducido
a la manipulación <b>sintáctica</b>. Esto no es <b>a priori</b> la esencia del sujeto, y podemos esperar que en las
siguientes décadas se encuentre un tratamiento de la computación que combine las ventajas de la
semántica denotacional (claridad matemática) con las de la sintaxis (dinámica finitista). Este
libro se asienta sobre la tradición que está basada en el estado actual de las cosas: en la dicotomía
entre la <b>denotación estática, infinita</b> y el <b>sentido dinámico, finito</b>, el lado denotacional está mucho más
desarrollado que el otro.
</p>

<p>
Así, una de las distinciones más fundamentales en la lógica es la hecha por Frege: dado un enunciado \(A\),
hay dos maneras de verlo:
</p>
<ul class="org-ul">
<li>como una secuencia de <b>instrucciones</b>, que determinan su <b>sentido</b>, por ejemplo, \(A \lor B\) significa "\(A\) o
\(B\)", etc..</li>
<li><p>
como el <b>resultado ideal</b> encontrado por estas operaciones: esto es su denotación.
</p>

<p>
La "Denotación", en oposición a la "notación" es lo que es <b>denotado</b>, no lo que <b>denota</b>. Por ejemplo, la
denotación de un enunciado lógico es <b>v</b> (verdadero) o <b>f</b> (falso), y la denotación de \(A \lor B\) se puede
obtener de las denotaciones de \(A\) y de \(B\) mediante la tabla de verdad para la disyunción.
</p></li>
</ul>

<p>
Dos enunciados que tienen el mismo sentido tienen la misma denotación, eso es obvio; pero dos enunciados con
la misma denotación raramente tienen el mismo sentido. Por ejemplo, tomemos una equivalencia matemática
complicada \(A \iff B\). Los dos enunciados tienen la misma denotación (son verdaderas al mismo tiempo) pero
seguramente no tienen el mismo sentido, si no, ¿cuál sería el sentido de mostrar la equivalencia?
</p>

<p>
Este ejemplo nos permite introducir algunas asociaciones de ideas:
</p>
<ul class="org-ul">
<li>sentido, sintaxis, demostraciones;</li>
<li><p>
denotación, veracidad, semántica, operaciones algebráicas.
</p>

<p>
Esta es la dicotomía fundamental de la lógica. Habiendo dicho esto, los dos lados dificilmente juegan
papeles simétricos.
</p></li>
</ul>
</div>
</div>
