Tipos/ProofsAndTypes/sentido.org
* La tradición algebráica
Esta tradición (que comenzó con Boole un buen tiempo antes que Frege) está basada en la aplicación
radical de la navaja de Ockham: simplemente desechamos el sentido y consideramos únicamente la denotación.
La justificación de esta mutilación lógica es su lado operacional: ¡funciona!

El punto de inflexión que estableció la predominancia de esta tradición fue el teorema de Löwenheim de
\(1916\). Hoy en día, uno puede ver a la Teoría de Modelos como el resultado de esta elección epistemológica
que es muy vieja. De hecho, considerando la lógica desde el punto de vista de la denotación, i.e., el
*resultado* de las operaciones, descubrimos una clase peculiar de álgebra, pero una que nos permite
investigar las operaciones poco familiares al álgebra tradicional. En particular, es posible esquivar
la limitante a las -podríamos decir- variedades *ecuacionales*, y considerar estructuras *definibles*.
Así, la Teoría de Modelos rejuvenece las ideas y métodos del álgebra de una manera muchas veces fructífera.

* La tradición sintáctica
Por otro lado, es imposible decir "olvidemos completamente la denotación y concentrémonos en el sentido",
por la simple razón de que el sentido contiene la denotación, al menos implícitamente. De modo que no es
un tema de simetría. De hecho, dificilmente hay un punto de vista sintáctico unificado, pues nunca hemos
sido capaces de dar un significado operacional a este *sentido* misterioso. La única realidad tangible
sobre el sentido es la forma en la que está escrito, el formalismo; pero el formalismo se mantiene como
un objeto de estudio que no se nos acomoda, sin estructura real, un pedazo de *camembert suave*.

¿Esto significa que el acercamiento puramente sintáctico no tienen nada que decir que valga la pena?
Por supuesto que no, y el famoso teorema de Gentzen de \(1934\) muestra que la lógica posee algunas simetrías
profundas a nivel sintáctico (expresado por *corte-eliminación*). Sin embargo, estas simetrías son hechas
borrosas por las imperfecciones de la sintaxis. Poniéndolo de otra manera, no son simetrías de sintaxis,
sino de sentido. Para obtener algo mejor, debemos expresarlas como propiedades de sintaxis y el resultado
no es muy bonito.

Recapitulando nuestra opinión sobre esta tradición, siempre está en busca de sus conceptos fundamentales,
es decir, una distinción operacional entre sentido y sintaxis. Poniéndolo más concretamente, busca encontrar
*invariantes* geométricos de la sintaxis: ahí es donde se encuentra el sentido.

La tradición llamada "sintáctica" -por falta de un título más noble- nunca llegó al nivel de su rival. En
años recientes, la tradición sintáctica no era de notarse y, sin duda, habría desaparecido en una o dos
décadas más, por falta de una metodología. El desastre fue esquivado por la ciencia de la computación -el
gran manipulador de sintaxis- que dio algunos problemas teóricos importantes.


Algunos de estos problemas (como las preguntas de la complejidad algorítmica) parecen requerir más la letra
que el espíritu de la lógica. Por otra parte, todos los problemas que conciernen a la correctud y modularidad
de los programas apelas de manera profunda a la tradición sintáctica, a la *teoría de la demostración*.
Somos llevados a la revisión de la teoría de la demostración, de la mano del teorema fundamental de Herbrand
que data de \(1930\). Esta revisión alumbra con una nueva luz esas áreas que se pensaban fijas, y donde la
rutina prevaleció por mucho tiempo.

En el intercambio entre la tradición lógica y la ciencia de la computación uno puede esperar nuevos lenguajes
y nuevas máquinas del lado computacional. Pero del lado de la lógica uno puede al menos esperar profundizar
en la base conceptual que durante tanto tiempo fue ignorada.

* Dos tradiciones semánticas
** Tarski
Esta tradición se distingue por su trivialidad: el conectivo "\(\lor\)" es traducido como "o", y así. Esta
interpretación no nos dice nada particularmente importante sobre los conectivos lógicos: su aparente
falta de ambición es su razón para su operacionalidad. Sólo nos interesa la denotación, *v* o *f* de
un enunciado (cerrado) de la sintaxis.
1. Para enunciados atómicos, asumimos que la denotación es conocida, por ejemplo:
   - \(3 + 2 = 5\) tiene la denotación *v*.
     \(3 + 3 = 5\) tiene la denotación *f*.
2. Las denotaciones de las expresiones \(A \land B, A \lor B, A \supset B\) y \(\lnot A\) se obtienen mediante una tabla de
   verdad:
    | \(A\) | \(B\) | \(A \land B\) | \(A \lor B\) | \( A \supset B\) | \(\lnot A\) |
    | *v*     | *v*     | *v*         | *v*         | *v*          | *f*           |
    | *f*     | *v*     | *f*         | *v*         | *v*          | *v*           |
    | *v*     | *f*     | *f*         | *v*         | *f*          |             |
    | *f*     | *f*     | *f*         | *f*         | *v*        |             |
3. La denotación de \(\forall \xi. A\) es *v* si y sólo si *para cada* \(a\) en el dominio de interpretación, \(A[a/\xi]\) es *v*.
   De igual manera, \(\exists \xi. A\) es *v* si y sólo si \(A[a/\xi]\) es *v* para alguna \(a\).

   De nueva cuenta, esta definición no dice mucho desde el punto de vista de la lógica, pero es adecuada
   para este propósito. El desarrollo de la Teoría de Modelos nos muestra esto.

