public/Tipos/ProofsAndTypes/sentido.html
<div id="outline-container-org93faaac" class="outline-2">
<h2 id="org93faaac">La tradición algebráica</h2>
<div class="outline-text-2" id="text-org93faaac">
<p>
Esta tradición (que comenzó con Boole un buen tiempo antes que Frege) está basada en la aplicación
radical de la navaja de Ockham: simplemente desechamos el sentido y consideramos únicamente la denotación.
La justificación de esta mutilación lógica es su lado operacional: ¡funciona!
</p>

<p>
El punto de inflexión que estableció la predominancia de esta tradición fue el teorema de Löwenheim de
\(1916\). Hoy en día, uno puede ver a la Teoría de Modelos como el resultado de esta elección epistemológica
que es muy vieja. De hecho, considerando la lógica desde el punto de vista de la denotación, i.e., el
<b>resultado</b> de las operaciones, descubrimos una clase peculiar de álgebra, pero una que nos permite
investigar las operaciones poco familiares al álgebra tradicional. En particular, es posible esquivar
la limitante a las -podríamos decir- variedades <b>ecuacionales</b>, y considerar estructuras <b>definibles</b>.
Así, la Teoría de Modelos rejuvenece las ideas y métodos del álgebra de una manera muchas veces fructífera.
</p>
</div>
</div>
<div id="outline-container-org2ef3891" class="outline-2">
<h2 id="org2ef3891">La tradición sintáctica</h2>
<div class="outline-text-2" id="text-org2ef3891">
<p>
Por otro lado, es imposible decir "olvidemos completamente la denotación y concentrémonos en el sentido",
por la simple razón de que el sentido contiene la denotación, al menos implícitamente. De modo que no es
un tema de simetría. De hecho, dificilmente hay un punto de vista sintáctico unificado, pues nunca hemos
sido capaces de dar un significado operacional a este <b>sentido</b> misterioso. La única realidad tangible
sobre el sentido es la forma en la que está escrito, el formalismo; pero el formalismo se mantiene como
un objeto de estudio que no se nos acomoda, sin estructura real, un pedazo de <b>camembert suave</b>.
</p>

<p>
¿Esto significa que el acercamiento puramente sintáctico no tienen nada que decir que valga la pena?
Por supuesto que no, y el famoso teorema de Gentzen de \(1934\) muestra que la lógica posee algunas simetrías
profundas a nivel sintáctico (expresado por <b>corte-eliminación</b>). Sin embargo, estas simetrías son hechas
borrosas por las imperfecciones de la sintaxis. Poniéndolo de otra manera, no son simetrías de sintaxis,
sino de sentido. Para obtener algo mejor, debemos expresarlas como propiedades de sintaxis y el resultado
no es muy bonito.
</p>

<p>
Recapitulando nuestra opinión sobre esta tradición, siempre está en busca de sus conceptos fundamentales,
es decir, una distinción operacional entre sentido y sintaxis. Poniéndolo más concretamente, busca encontrar
<b>invariantes</b> geométricos de la sintaxis: ahí es donde se encuentra el sentido.
</p>

<p>
La tradición llamada "sintáctica" -por falta de un título más noble- nunca llegó al nivel de su rival. En
años recientes, la tradición sintáctica no era de notarse y, sin duda, habría desaparecido en una o dos
décadas más, por falta de una metodología. El desastre fue esquivado por la ciencia de la computación -el
gran manipulador de sintaxis- que dio algunos problemas teóricos importantes.
</p>


<p>
Algunos de estos problemas (como las preguntas de la complejidad algorítmica) parecen requerir más la letra
que el espíritu de la lógica. Por otra parte, todos los problemas que conciernen a la correctud y modularidad
de los programas apelas de manera profunda a la tradición sintáctica, a la <b>teoría de la demostración</b>.
Somos llevados a la revisión de la teoría de la demostración, de la mano del teorema fundamental de Herbrand
que data de \(1930\). Esta revisión alumbra con una nueva luz esas áreas que se pensaban fijas, y donde la
rutina prevaleció por mucho tiempo.
</p>

<p>
En el intercambio entre la tradición lógica y la ciencia de la computación uno puede esperar nuevos lenguajes
y nuevas máquinas del lado computacional. Pero del lado de la lógica uno puede al menos esperar profundizar
en la base conceptual que durante tanto tiempo fue ignorada.
</p>
</div>
</div>
<div id="outline-container-org1183a49" class="outline-2">
<h2 id="org1183a49">Dos tradiciones semánticas</h2>
<div class="outline-text-2" id="text-org1183a49">
</div>
<div id="outline-container-orgb509830" class="outline-3">
<h3 id="orgb509830">Tarski</h3>
<div class="outline-text-3" id="text-orgb509830">
<p>
Esta tradición se distingue por su trivialidad: el conectivo "\(\lor\)" es traducido como "o", y así. Esta
interpretación no nos dice nada particularmente importante sobre los conectivos lógicos: su aparente
falta de ambición es su razón para su operacionalidad. Sólo nos interesa la denotación, <b>v</b> o <b>f</b> de
un enunciado (cerrado) de la sintaxis.
</p>
<ol class="org-ol">
<li>Para enunciados atómicos, asumimos que la denotación es conocida, por ejemplo:
<ul class="org-ul">
<li>\(3 + 2 = 5\) tiene la denotación <b>v</b>.
\(3 + 3 = 5\) tiene la denotación <b>f</b>.</li>
</ul></li>
<li><p>
Las denotaciones de las expresiones \(A \land B, A \lor B, A \supset B\) y \(\lnot A\) se obtienen mediante una tabla de
verdad:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">\(A\)</td>
<td class="org-left">\(B\)</td>
<td class="org-left">\(A \land B\)</td>
<td class="org-left">\(A \lor B\)</td>
<td class="org-left">\( A \supset B\)</td>
<td class="org-left">\(\lnot A\)</td>
</tr>

<tr>
<td class="org-left"><b>v</b></td>
<td class="org-left"><b>v</b></td>
<td class="org-left"><b>v</b></td>
<td class="org-left"><b>v</b></td>
<td class="org-left"><b>v</b></td>
<td class="org-left"><b>f</b></td>
</tr>

<tr>
<td class="org-left"><b>f</b></td>
<td class="org-left"><b>v</b></td>
<td class="org-left"><b>f</b></td>
<td class="org-left"><b>v</b></td>
<td class="org-left"><b>v</b></td>
<td class="org-left"><b>v</b></td>
</tr>

<tr>
<td class="org-left"><b>v</b></td>
<td class="org-left"><b>f</b></td>
<td class="org-left"><b>f</b></td>
<td class="org-left"><b>v</b></td>
<td class="org-left"><b>f</b></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><b>f</b></td>
<td class="org-left"><b>f</b></td>
<td class="org-left"><b>f</b></td>
<td class="org-left"><b>f</b></td>
<td class="org-left"><b>v</b></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table></li>
<li><p>
La denotación de \(\forall \xi. A\) es <b>v</b> si y sólo si <b>para cada</b> \(a\) en el dominio de interpretación, \(A[a/\xi]\) es <b>v</b>.
De igual manera, \(\exists \xi. A\) es <b>v</b> si y sólo si \(A[a/\xi]\) es <b>v</b> para alguna \(a\).
</p>

<p>
De nueva cuenta, esta definición no dice mucho desde el punto de vista de la lógica, pero es adecuada
para este propósito. El desarrollo de la Teoría de Modelos nos muestra esto.
</p></li>
</ol>
</div>
</div>
