public/Tipos/ProofsAndTypes/sentido.html
<div id="outline-container-org6d132e4" class="outline-3">
<h3 id="org6d132e4">Heyting</h3>
<div class="outline-text-3" id="text-org6d132e4">
<p>
La idea de Heyting es menos conocida, pero es difícil imaginar una mayor disparidad entre la genialidad
de la idea original y la mediocridad de su desarrollo subsecuente. La mira es extremadamente ambiciosa:
no modelar la <b>denotación</b>, sino las <b>demostraciones</b>.
</p>

<p>
En lugar de preguntarnos, "¿cuándo es verdadero un enunciado \(A\)?", nos preguntamos
"¿qué es una demostración de \(A\)?". Por <b>demostración</b> no nos referimos a la transcripción formal sintáctica,
si no al objeto inherente del cual la transcripción hace meramente una sombra. Tomamos el punto de
vista de que lo que <b>escribimos</b> como una demostración es meramente la descripción de algo que es
<b>en sí mismo</b> un proceso. Nuestra respuesta a nuestra pregunta extremadamente ambiciosa nu puede ser
simplemente un <b>sistema formal</b>.
</p>
<ol class="org-ol">
<li>Para los enunciados atómicos, suponemos que sabemos intrínsecamente qué es una demostración; por
ejemplo, el cálculo a papel y lápiz sirve como prueba de que "\(27 \times 37 = 999\)".</li>
<li>Una prueba de \(A \land B\) es un par \((p, q)\) que consiste de una prueba \(p\) de \(A\) y una prueba \(q\) de \(B\).</li>
<li>Una prueba de \(A \lor B\) es un par \(i, p\) con:
<ul class="org-ul">
<li>\(i = 0\), y una prueba \(p\) de \(A\), o</li>
<li>\(i = 1\), y una prueba \(p\) de \(B\).</li>
</ul></li>
<li>Una prueba de \(A \supset B\) es una función \(f\), que manda una prueba \(p\) de \(A\) a una prueba \(f(p)\)  de \(B\).</li>
<li>En general, la negación \(\lnot A \) es tratada como \(A \supset \bot\) donde \(\bot\) es un enunciado que no admite una
demostración</li>
<li>Una prueba de \(\forall \xi. A\) es una función \(f\) que manda cada punto \(a\) del dominio de definición a
una prueba \(f(a)\) de \(A[a/\xi]\).</li>
<li><p>
Una prueba de \(\exists \xi. A\) es un par \((a, p)\) donde \(a\) es un punto en el dominio de definición y \(p\) es una prueba
de \(A[a/\xi]\).
</p>

<p>
Por ejemplo, el enunciado \(A \supset A\) se prueba por la función identidad, que le asocia a cada prueba \(p\)
de \(A\), la misma prueba. Por otra parte, ¿cómo podemos mostrar \(A \lor \lnot A\)? Deberíamos ser capaces de
encontrar ya sea una prueba de \(A\) o una de \(\lnot A\) y esto no es posible en general. La semántica de
Heyting, entonces, corresponde a otra lógica, la lógica <b>intuicionista</b> de Brouwer, que encontraremos
después.
</p>

<p>
Sin lugar a dudas, la semántica de Heyting es muy original: no interpreta los conectivos lógicos por
sí mismos, sino sus construcciones abstractas. Ahora podemos ver que estas construcciones no son más que
programas tipados. Pero los expertos en el área han visto algo muy distinto, un acercamiento funcional
a las matemáticas. En otras palabras, la semántica de las demostraciones expresarían la esencia de las
matemáticas.
</p>

<p>
Por un lado tenemos la tradición de Tarski, que se común y honesta ("\(\lor\)" significa "o", "&forall;" significa
"para todo"), sin mucha pretensión. Tampoco tiene un prospecto fundacional, pues para su fundamento,
uno tiene que dar una explicación en términos de algo más primitivo, que también necesita su propio
fundamento. La tradición de Heyting es original, pero fundamentalmente tiene los mismos problemas -los
teoremas de incompletitud de Gödel nos lo aseguran. Si buscamos explicar \(A\) por el hecho de demostrar
\(A\), nos topamos con el hecho de que la demostración usa cuantificadores dos veces (para \(\supset\) y
\(\forall\)). Más aún, en el caso de \(\supset\), uno no puede decir que el dominio de definición de \(f\) esté bien entendido.
</p>

<p>
Volveremos a la idea de Heyting cuando trabajemos sobre el isomorfismo de Curry-Howard. Esto nos permite
hacer uso de una idea que podría tener aplicaciones espectaculares en el futuro.
</p></li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>
